tap "d12frosted/emacs-plus"
tap "jondot/tap"
tap "railwaycat/emacsmacport"
tap "tilt-dev/tap"
# Library and utilities for processing GIFs
brew "giflib"
# Library for manipulating PNG images
brew "libpng"
# Text processing scripting language
brew "awk"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Programming language for highly scalable real-time systems
brew "erlang"
# Perl script to extracts URLs from emails or plain text
brew "extract_url"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# High performance message passing library
brew "open-mpi"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# CLI for Heroku
brew "heroku"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12", link: false
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# International Ispell
brew "ispell"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# JIT library for the GNU compiler collection
brew "libgccjit"
# Postgres C API library
brew "libpq"
# Library to render SVG files using Cairo
brew "librsvg"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# YAML Parser
brew "libyaml"
# Utility for directing compilation
brew "make"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@15"
# Messaging and streaming broker
brew "rabbitmq"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# URL extractor/launcher
brew "urlview"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Image processing library
brew "vips"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-dbus", "with-imagemagick", "with-mailutils", "with-xwidgets"]
# A dev environment as code for microservice apps
brew "tilt-dev/tap/tilt"
# Command-line interface for 1Password
cask "1password-cli"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-roboto"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Menu bar manager
cask "jordanbaird-ice"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Music streaming service
cask "spotify"
vscode "anysphere.cursorpyright"
vscode "bierner.markdown-mermaid"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "datadog.datadog-vscode"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "mcaragheorghe.vim-enhanced"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode.makefile-tools"
vscode "shopify.ruby-lsp"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
